[
	{
		"name": "PyPlay",
		"type": "Hackathon",
		"tech" : ["Python", "Heroku", "HTML5"],
		"banner": "https://images.squarespace-cdn.com/content/55ed941ee4b0fe005b38b95d/1503770964368-MDMOLHC22MDRVHIU6EPS/monzocard.jpg?format=1500w&content-type=image%2Fjpeg",
		"url": "pyplay",
		"dates": "February 2020",
		"short_desc": "An app to teach young coders the basics of Python",
		"long_desc": "Creativity, Curiosity, Coding! Those are our three C's, our core values here at PyPlay. We wanted to create an application to teach young coders the basics of Python. We want to provide an easy-to-use interface, where kids can write code, and visually see their code come to life. Unlike other platforms, where you drag-and-drop blocks, with PyPlay, you're actually writing real Python code! We created this for IC Hack 2020.",
		"sources": [
			{
				"name": "github",
				"url": "https://github.com/jackmorrison12/pyplay"
			},
			{
				"name": "devpost",
				"url": "https://devpost.com/software/pyplay"
			},
			{
				"name": "website",
				"url": "http://code.pyplay.co.uk/"
			}
		],
		"pictures": [
			"/images/projects/pyplay-1.jpg"
		]
	},
	{
		"name": "Canvas",
		"type": "Uni Project",
		"tech" : ["Swift", "XCode", "CRDTs"],
		"banner": "tbd",
		"url": "canvas",
		"dates": "October 2019 - January 2020",
		"short_desc": "A CRDT-powered collaborative drawing app, created for my 3rd year software engineering group project.",
		"long_desc": "Remote collaboration has been increasing in popularity over the last couple of years, within professional working environments, academia as well as other fields. Tools for visual collaboration, such as through drawing, are currently lacking, with many suffering from lag, dropped connections or devices not syncing together correctly.  We have created a resilient collaborative drawing app for iOS using Conflict-free Replicated Data Rypes (CRDTs) that aims to prevent failures as listed previously from becoming an issue.\n<br><br>Our app, which is optimised for iPads, is called Canvas. Canvas allows users to connect and draw at the same time. Changes are propagated in real time, so if a user becomes temporarily disconnected, on reconnection, the changes that they made during this period will sync up. Canvas offers features such as shape recognition and bluetooth network optimisation.\n<br><br>CRDTs are a class of abstract data types that allow their state to be distributed across devices, modified locally and then merged in a straight-forward manner. The important thing to note is that CRDTs guarantee eventual consistency. Therefore, Canvas is completely de-centralized, i.e. it does not rely on one of the nodes to always be connected. ",
		"sources": [
			{
				"name": "github",
				"url": "https://github.com/mnckapilan/crdt-canvas"
			}
		]
	},
	{
		"name": "Burst My Bubble",
		"type": "Uni Project",
		"tech" : ["React", "Java", "MongoDB"],
		"banner": "https://www.thoughtco.com/thmb/yT6yrtBDJDAxl7pIwwJ7-e1l97o=/2000x1334/filters:no_upscale():max_bytes(150000):strip_icc()/GettyImages-551987659-5898c5b73df78caebc9e43f1.jpg",
		"url": "burst-my-bubble",
		"dates": "May 2019 - June 2019",
		"short_desc": "This was a webapp created using React, Python, Java, MongoDB and Azure,  in order to tackle the problem of confirmation bias in the current consumption of the news.",
		"long_desc": "This was our end of second year group project, where the brief was to create a webapp. We decided to create a news feed with a difference. The aim was to encourage people to change up their news sources and read some new material in order to \"Burst their Bubble\". We wrote it using React for the frontend and Python/Java for the backend, and used a MongoDB database.",
		"sources": [
			{
				"name": "gitlab",
				"url": "https://gitlab.doc.ic.ac.uk/BurstMyBubble"
			}
		],
		"pictures": [
			"/images/projects/bmb-1.png",
			"/images/projects/bmb-2.png",
			"/images/projects/bmb-3.png",
			"/images/projects/bmb-4.png"
		]
	},
	{
		"name": "WACC",
		"type": "Uni Project",
		"tech" : ["Kotlin", "ANTLR"],
		"banner": "https://softwareengineeringdaily.com/wp-content/uploads/2018/10/kotlin.jpg",
		"url": "wacc",
		"dates": "January 2019 - March 2019",
		"short_desc": "This is our second year compilers project, where we are creating a compiler for a programming language.",
		"long_desc": "This is our second year compilers project, where we are creating a compiler for a programming language. We wrote the compiler in Kotlin.<br>Unfortunately, the code for this project cannot be shared, as the task will be reused in future years."
	},
	{
		"name": "Correct-a-Spine",
		"type": "Hackathon",
		"tech" : ["C", "Swift", "Arduino"],
		"banner": "https://embed.widencdn.net/img/veritas/hhfs20mdfz/1280x720px/thoracic-vertebrae.jpeg",
		"url": "correct-a-spine",
		"dates": "March 2019",
		"short_desc": "This was a hackathon entry for Imperial College Health Hack 19. We created a device to prevent back pain using sensors and an iOS app.",
		"long_desc": "This was a hackathon entry for Imperial College Health Hack 19. Problems with posture arise because of upper and lower back problems, but the current technologies only focus on one of these, and so we decided to use an accelerometer and flex sensor to measure both of these to prevent both kinds of back pain with a single device. The results are shows in an iOS application which is sent the data via Bluetooth.",
		"sources": [
			{
				"name": "github",
				"url": "https://github.com/ricardomokhtari/HealthHack2019"
			},
			{
				"name": "devpost",
				"url": "https://devpost.com/software/correct-a-spine"
			}
		],
		"pictures": [
			"/images/projects/cas-1.jpg",
			"/images/projects/cas-2.jpg",
			"/images/projects/cas-3.jpg",
			"/images/projects/cas-4.jpg",
			"/images/projects/cas-5.png"
		]
	},
	{
		"name": "Automatic Monzo Receipts from Gmail",
		"type": "Hackathon",
		"tech" : ["Python", "Flask", "SQLite"],
		"banner": "https://images.squarespace-cdn.com/content/55ed941ee4b0fe005b38b95d/1503770964368-MDMOLHC22MDRVHIU6EPS/monzocard.jpg?format=1500w&content-type=image%2Fjpeg",
		"url": "monzo-receipts",
		"dates": "January 2019",
		"short_desc": "This was a hackathon entry for Cambridge Hack 4D. It used APIs from Monzo, Gmail and Microsoft Azure.",
		"long_desc": "This app was created as part of Cambridge Hack 4D. <br>It displays recent transactions to the user, and if the user clicks the \"Add Receipt\" button, then it will use the Gmail API to scan their emails, find the correct one, and gather the receipt data, adding this to the Monzo application. <br>It is also possible to have pictures of receipts if they are physical and not in the emails, and then the same algorithm is run on the text data gathered from the receipt using Microsoft Azrure OCR to get the equivalent information and add it to the transaction in the Monzo app.",
		"sources": [
			{
				"name": "github",
				"url": "https://github.com/et-tamen-compilat/monzo-receipts"
			},
			{
				"name": "devpost",
				"url": "https://devpost.com/software/monzo-receipts"
			}
		],
		"pictures": [
			"/images/projects/monzo-receipts.png"
		]
	},
	{
		"name": "Pintos",
		"type": "Uni Project",
		"tech" : ["C"],
		"banner": "https://static.techspot.com/images2/news/bigimage/2018/07/2018-07-10-image-35.jpg",
		"url": "pintos",
		"dates": "October 2018 - December 2018",
		"short_desc": "This was our 2nd year operating systems project, where the task was to implement different parts of an operating system.",
		"long_desc": "This was our 2nd year operating systems project, where the task was to implement different parts of an operating system, including scheduling, user programs and virtual memory. This project was written entirely in C.<br>Unfortunately, the code for this project cannot be shared, as the task will be reused in future years."
	},
	{
		"name": "MentorMe",
		"type": "External Project",
		"tech" : [ "React", "Node", "MongoDB"],
		"banner": "https://cdn.vox-cdn.com/thumbor/OTFuSU3Vo3iwKvL-MAh34AD2AyE=/0x0:2040x1360/1200x800/filters:focal(857x517:1183x843)/cdn.vox-cdn.com/uploads/chorus_image/image/62954051/mdoying_180118_2249_facebook_0445stills_3.0.jpg",
		"url": "mentor-me",
		"dates": "September 2018 - November 2018",
		"short_desc": "We created a project as part of the Facebook Hack-a-Project with the aim of \"Bringing Communities Together\".",
		"long_desc": "We created a project as part of the Facebook Hack-a-Project with the aim of \"Bringing Communities Together\". Our application is a mentoring application which allows people with valuable skills and experiences to trade that knowledge for knowledge from others. It was built using the MERN stack (MongoDB, Express, React and Node.js).",
		"sources": [
			{
				"name": "github",
				"url": "https://github.com/HashimR/mentorme"
			}
		]
	},
	{
		"name": "Snake Arcade Machine",
		"type": "Uni Project",
		"tech" : ["C"],
		"banner": "https://i.ytimg.com/vi/DW2ZxWX5XAY/maxresdefault.jpg",
		"url": "snake",
		"dates": "May 2018 - June 2018",
		"short_desc": "This was the extension to our third term group project in first year, where we chose to recreate the classic game of snake on a 32x32 LED matrix.",
		"long_desc": "We chose to recreate the classic game of snake on a 32x32 LED matrix. We did this by using a hat for the Raspberry Pi to connect it to the matrix, and created 4 modes for the game, one of which was an Artificial Intelligence. We also created an arcade-machine inspired box for the project, and created all of our own sounds too.<br>This project won the prize for the best group project extension, judged by the creators of the Raspberry Pi themselves.",
		"sources": [
			{
				"name": "github",
				"url": "https://github.com/et-tamen-compilat/snake"
			}
		],
		"videos": [
			{
				"title": "Startup",
				"url": "https://www.youtube.com/embed/j-aXoEqF7yU"
			},
			{
				"title": "Classic Mode",
				"url": "https://www.youtube.com/embed/072oDonJBBU"
			},
			{
				"title": "Crazy Mode",
				"url": "https://www.youtube.com/embed/l9AlzzPRaXk"
			},
			{
				"title": "Maze Mode",
				"url": "https://www.youtube.com/embed/DRKbVj0Y6U0"
			},
			{
				"title": "AI Timelapse",
				"url": "https://www.youtube.com/embed/h3LU4xwfbko"
			}
		]
	},
	{
		"name": "ARM11 Emulator and Assembler",
		"type": "Uni Project",
		"tech" : ["C"],
		"banner": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/6f/Raspberry_Pi_B%2B_top.jpg/2560px-Raspberry_Pi_B%2B_top.jpg",
		"url": "arm11",
		"dates": "May 2018 - June 2018",
		"short_desc": "This project entailed creating an ARM11 Emulator and Assembler in C, then using these in combination with a Raspberry Pi to control an LED.",
		"long_desc": "This project was completed in the final term of my first year undergraduate studies. It entailed creating an ARM11 Emulator and Assembler in C, then using these in combination with a Raspberry Pi to control an LED.<br>Unfortunately the code for the emulator and assembler cannot be shared here as the task will be reused in future years."
	},
	{
		"name": "Deep Learning in Medical Imaging Analysis",
		"type": "Uni Project",
		"tech" : ["HTML", "CSS", "Pandoc"],
		"banner": "https://www.doc.ic.ac.uk/~jce317/content-images/medImaging.png",
		"url": "topics",
		"dates": "January 2018 - March 2018",
		"short_desc": "This project was undertaken as my first year group project, and involved creating a website discussing the uses of AI in Medical Imaging Analysis.",
		"long_desc": "This project was undertaken as my first year group project, and involved creating a website discussing the uses of AI in Medical Imaging Analysis.<br>Our main areas of research were to look into the history and evolution of medical imaging and machine learning as separate topics, and then find areas in which they overlapped. We looked at Convolutional Neural Networks, along with Semantic Segmentation, as these are the most commmonplace in medical imaging. We then looked at overlapping topics, these being the uses of AI in radiology, and a deeper case study into the user for detection of lung cancer.",
		"sources": [
			{
				"name": "website",
				"url": "https://www.doc.ic.ac.uk/~jce317/"
			},
			{
				"name": "github",
				"url": "https://github.com/et-tamen-compilat/medical-image-computing"
			}
		]
	},
	{
		"name": "To What Extent are Computer-Assisted Proofs Valid?",
		"type": "School Project",
		"tech" : ["Extended Writing"],
		"banner": "https://miro.medium.com/max/3840/1*XZrU5omVCZPZXuYv2AZnog.jpeg",
		"url": "epq",
		"dates": "September 2016 - May 2017",
		"short_desc": "This project was completed as my Extended Project during my A Level studies, and discussed the controversy over computer-assisted proofs.",
		"long_desc": "This project was completed as my Extended Project during my A Level studies, and discussed the controversy over computer-assisted proofs.<br>At the start of this project, I was unfamiliar with the area of computer-assisted proofs, and mathematical proofs in general for that matter. I decided on the topic because my mathematics teacher had discussed it in a lesson and I was curious to find out more. He mentioned that many mathematicians, to my surprise, did not agree that a theorem which had been proved using proof by exhaustion on a computer was legitimate. I did not understand their reasoning behind it not being a proof, because I presumed that if every case was proved to be true, then the proof would have to be valid. That is why I became interested in the subject, and when that chance to write a project on the topic arose, I decided I wanted to consider it further.",
		"sources": [
			{
				"name": "file",
				"url": "/files/epq.pdf"
			}
		]
	},
	{
		"name": "iMaths",
		"type": "School Project",
		"tech" : ["Swift", "XCode"],
		"banner": "https://www.tes.com/tesv2/files/styles/news_article_ml_x2/public/news-images/maths_blackboard.jpg?itok=wjVI9D-w",
		"url": "imaths",
		"dates": "June 2016 - March 2017",
		"short_desc": "This project was mainly undertaken during the second year of my A Level Computing studies, with the task to create a mobile application.",
		"long_desc": "This project was mainly undertaken during the second year of my A Level Computing studies, with the task to create a mobile application.<br>I decided to create an app which could generate random GCSE-level mathematics questions for students so that they could test their knowledge. It could also check to see if their answers were correct, and had other features such as a leaderboard with friends, and streaks to encourage daily use. I made the application for iOS devices, and so had a lot of experience with the Swift programming language and XCode. This project was a fun way of teaching myself a new programming language from scratch, as I was never taught it in a formal environment. This meant I became used to using manuals for the language to look up syntax and specific features of the language, which was a great learning experience.",
		"sources": [
			{
				"name": "github",
				"url": "https://github.com/jackmorrison12/ALevelCoursework"
			}
		]
	}
]